backend/app/controllers/api/v1/authors_controller.rb

 def create
   @author = Author.create(author_params)
---
INSERT INTO "authors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New Guy"], ["created_at", "2020-07-22 21:24:25.594598"], ["updated_at", "2020-07-22 21:24:25.594598"]]

 def update
   @author = Author.find_by_id(params[:id])

   if @author.update(author_params)
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "authors" SET "name" = $1, "updated_at" = $2 WHERE "authors"."id" = $3  [["name", "Edgar Allan Po"], ["updated_at", "2020-07-23 02:23:57.149144"], ["id", 7]]