backend/app/controllers/api/v1/books_controller.rb

  def destroy
    @book = Book.find_by_id(params[:id])
    if @book.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = $1  [["id", 1]]

  def update
    @book = Book.find_by_id(params[:id])

    @book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Tom Sawy"], ["updated_at", "2020-07-22 03:23:41.455387"], ["id", 11]]